#include "EmergencyModel.h"
#include "qjsonobject.h"

EmergencyModel::EmergencyModel(){}

void EmergencyModel::createJson(){

    QJsonObject shock;
    shock["name"]="休克";
    shock["symptom"]=QJsonArray{"皮肤苍白","出冷汗","脉搏加快"};
    shock["keywords"]=QJsonArray{"脸色发白","面色苍白","出冷汗","脉搏加快"};
    shock["steps"]=QJsonArray{"将伤者双足提高，增加心脏和脑部的血液供应","保持伤者温暖"};
    shock["urgency"]=5;
    emergencyType.append(shock);

    QJsonObject fracture;
    fracture["name"]="骨折";
    fracture["symptom"]=QJsonArray{"骨折","伤处肿起，随后出现瘀血为闭合性骨折","可见断骨端，为开放性骨折"};
    fracture["keywords"]=QJsonArray{"骨折","骨头疼","开放性骨折","瘀血"};
    fracture["steps"]=QJsonArray{"观察骨折部位：（1）无法正常活动，疼痛会随活动或触动而增加，伤处肿起，随后出现瘀血为闭合性骨折。（2）无法活动，可见断骨端，为开放性骨折。"
                                   ,"若有休克或呼吸受阻症状，应先处理","除非处境对生命构成危险，否则不应随便移动伤者"
                                   ,"固定折骨：稳定及扶持折骨之上下位置，用木板或竹竿固定断骨位，长度以超过上下两关节为原则，再用绷带包扎，将伤肢与躯体绑住。"};
    fracture["urgency"]=4;
    fracture["video"]="C:/FirstAidapp/video/fracture.mp4";
    emergencyType.append(fracture);

    QJsonObject nosebleed;
    nosebleed["name"]="流鼻血";
    nosebleed["symptom"]=QJsonArray{"流鼻血"};
    nosebleed["keywords"]=QJsonArray{"流鼻血","鼻子出血","大量流血",};
    nosebleed["steps"]=QJsonArray{"让伤者坐下或站著，切勿躺下，头稍向前倾","劝他用口呼吸，以手稍为用力捏住鼻部软骨"
                                    ,"要他吐出口中的血液，因为吞血可能引起恶心、呕吐等","若大量流血，应立刻送院诊治"
                                    ,"如小量流血，十分钟后放松压力，若仍然出血，再压十分钟。暂时不要让伤者抬起头来","如果三十分钟后，仍不止血，应送医院治疗"};
    nosebleed["urgency"]=1;
    emergencyType.append(nosebleed);

    QJsonObject e1;
    e1["name"]="头部创伤";
    e1["symptom"]=QJsonArray{"头部创伤","头痛"};
    e1["keywords"]=QJsonArray{"头部创伤","头痛","头部流血","头晕","呕吐","颈痛","神志不清","语无伦次"};
    e1["steps"]=QJsonArray{"如有伤口流血,可压迫相应区域供血动脉止血","如有呕吐，摆复苏体位"
                                    ,"头伤后四十八小时，若有以下现象，应速往医院检：头晕及呕吐、头痛、颈痛及僵硬、神智不清、语无伦次或部分身体失控、昏睡"};
    e1["urgency"]=4;
    emergencyType.append(e1);

    QJsonObject e2;
    e2["name"]="触电";
    e2["symptom"]=QJsonArray{"触电"};
    e2["keywords"]=QJsonArray{"触电","电击"};
    e2["steps"]=QJsonArray{"迅速截断电流，才可接触伤者","如不能切断电流，可用竹、木或木椅等绝缘物件把伤者与电源分开"
                             ,"检查伤者状况，若心跳和呼吸停止，应立刻施行心肺复苏法","迅速通知救伤车送院救治"};
    e2["urgency"]=5;
    e2["video"]="C:/FirstAidapp/video/e2.mp4";
    emergencyType.append(e2);

    QJsonObject e3;
    e3["name"]="中毒";
    e3["symptom"]=QJsonArray{"呕吐","腹痛","抽筋","神志不清","昏迷","呼吸困难","口角留有沾污痕迹"};
    e3["keywords"]=QJsonArray{"呕吐","腹痛","抽筋","神志不清","昏迷","呼吸困难","口角留有沾污痕迹","误服药物或化学品","煤气或石油气中毒"};
    e3["steps"]=QJsonArray{"误服药物或化学品","一、若伤者清醒，误服物确定为腐蚀性物品，禁止洗胃，可让他喝鲜牛奶或蛋清等润滑剂，防止吸收。二、若伤者失去知觉，切勿给他任何食物或饮品，以免食物或液体流入呼吸道。三、连同致毒物质和呕吐物样本一同带去医院，为进一步治疗提供方向。四、若十二小时后才呕吐或腹泻，仍要多饮水，并从速求医。"
                             ,"煤气或石油气中毒","一、用手帕掩盖自己的口和鼻，或忍住呼吸。二、打开所有门、窗，切勿开关电器或燃起火种。三、把燃气供应关闭。四、将伤者移至新鲜空气流通的地方。五、到安全地通知救护车。六、若伤者呼吸停止，应立刻施行人工呼吸。"};
    e3["urgency"]=4;
    emergencyType.append(e3);

    QJsonObject e4;
    e4["name"]="窒息";
    e4["symptom"]=QJsonArray{"窒息","呼吸困难","面部充血或变为紫蓝色","咳嗽","","",""};
    e4["keywords"]=QJsonArray{"窒息","呼吸困难","面部充血或变为紫蓝色","咳嗽"};
    e4["steps"]=QJsonArray{"除去伤者口中物，如食物碎屑、假牙等，鼓励他咳嗽","伤者或站或坐，协助其弯腰使头部低於肺部，用手掌大力拍他的肩胛骨之间，可连续做四次，使堵塞物自行排出"
                             ,"如果已见到堵塞物在口腔内，但又咳不出来，可以用手指将之挖出","必要时施行人工呼吸"};
    e4["urgency"]=5;
    emergencyType.append(e4);

    QJsonObject e5;
    e5["name"]="不省人事";
    e5["symptom"]=QJsonArray{"意识混乱","清醒程度低","","","",""};
    e5["keywords"]=QJsonArray{"不省人事","意识混乱","呼吸、脉搏、清醒程度",""};
    e5["steps"]=QJsonArray{"将伤者以「复原卧姿」躺下，以防止舌头阻塞喉部，亦可令呕吐物容易流出","保持空气流通，解松伤者的紧身衣物，如颈喉纽等"
                             ,"保持呼吸道畅通，清除口中物体，如食物、呕吐物、容易松脱的假牙等","检查呼吸、脉搏、清醒程度及受伤情况。若呼吸及心跳停止，即施行心肺复苏法"
                            ,"处理严重的伤口,安排送院,不可给予饮食,继续观察清醒程度的变化","",""};
    e5["urgency"]=4;
    e5["video"]="C:/FirstAidapp/video/e5.mp4";
    emergencyType.append(e5);

    QJsonObject e6;
    e6["name"]="小儿痉挛";
    e6["symptom"]=QJsonArray{"高热惊厥","癫痫性痉挛","低钙性抽搐","局灶性痉挛","",""};
    e6["keywords"]=QJsonArray{"体温骤升","全身性抽搐","意识丧失","双眼上翻","口吐白沫","部分肢体或面部肌肉抽搐"};
    e6["steps"]=QJsonArray{"癫痫或小儿痉挛发作时，应注意不可让他撞伤头部","若牙关咬紧时，决不可强硬撬开，以免造成伤害"
                             ,"不要企图强行停止抽搐，因为通常抽搐会在数分钟内自行停止","尽可能解松病人衣物，以保持呼吸道畅通"
                             ,"抽搐停止后，一般会进入昏睡状态，清除伤者口内的呕吐物或假牙等","将伤者半侧身伏卧,速送院诊治","伤者清醒后，因抽搐时消耗体力甚大，所以应让他休息"};
    e6["urgency"]=3;
    e6["video"]="C:/FirstAidapp/video/e6.mp4";
    emergencyType.append(e6);

    QJsonObject e7;
    e7["name"]="肌肉抽筋";
    e7["symptom"]=QJsonArray{"抽筋","","","","",""};
    e7["keywords"]=QJsonArray{"抽筋","肌肉抽筋","",""};
    e7["steps"]=QJsonArray{"手抽筋：一、慢慢拉直患者的手指。二、然后轻轻按摩。","大腿抽筋：一、将膝部拉直。二、一手放在脚跟下，抬高腿部。三、另一手按压膝部，轻轻按摩抽筋的肌肉。"
                             ,"小腿抽筋：一、小心伸直膝盖。二、轻轻抬起腿部，将脚掌向上屈，慢慢压向小腿。三、轻轻按摩抽筋的肌肉。","脚抽筋：一、将脚趾拉直。二、轻轻按摩脚部肌肉。"
                             ,"","",""};
    e7["urgency"]=2;
    e7["video"]="C:/FirstAidapp/video/e7.mp4";
    emergencyType.append(e7);

    QJsonObject e8;
    e8["name"]="烧伤烫伤";
    e8["symptom"]=QJsonArray{"抽筋","","","","",""};
    e8["keywords"]=QJsonArray{"抽筋","肌肉抽筋","",""};
    e8["steps"]=QJsonArray{"小面积烧伤抹上少许牙膏。","1、如果烧伤的部位是头和颈部，则不用包扎，应采用暴露疗法，只在创面涂以烧伤药膏即可，但不可让鼻涕、眼泪、唾液污染创面。一旦创面遭到严重污染，必要时，应到医院注射破伤风抗毒素和抗生素，以控制感染。"
                             ,"2、如果烧伤后，水泡已破，且局部被脏物污染，则应用生理盐水冲洗，周围也应清洁消毒，然后在创面盖凡士林纱布和无菌纱布包扎，每2—3日换药一次。"
                             ,"3、如果烧伤后有水泡形成，最好不要刺破水泡，以免感染，如水泡较大需要到医院请医生处理。"
                             ,"4、对于小面积轻度烧伤，可用冷水及时冲洗局部，以降低温度，减轻痛感与肿胀。如果烧伤的局部很脏，可用肥皂水冲洗，但不可用力擦洗；蘸干水后，再涂上烫伤膏、红花油等药品。",""};
    e8["urgency"]=2;
    e8["video"]="C:/FirstAidapp/video/e8.mp4";
    emergencyType.append(e8);

    QJsonObject e9;
    e9["name"]="溺水";
    e9["symptom"]=QJsonArray{"溺水","","","","",""};
    e9["keywords"]=QJsonArray{"溺水","落水","呛水",""};
    e9["steps"]=QJsonArray{"1.拨打120，在急救的第一步就是通知120，而伤者都必须以颈椎受伤者处理，以避免急救完伤者已成植物人，在国外文献报告中，有人反映不当急救造成脊椎受损。"
                             ,"2.排除异物，救上来只是工作的一半，使溺水者复苏是另一半，而且对挽救生命来说是同等重要的。首先清理溺水者口鼻内污泥、痰涕，有假牙取下假牙，救护人员单腿屈膝，将溺水者俯卧于救护者的大腿上，借体位使溺水者体内水由气管口腔中排出（有些农村将溺水者俯卧横入在牛背上，头脚下悬，赶牛行走，这样又控水、又起到人工呼吸作用），将溺水者头部转向侧面，以便让水从其口鼻中流出，保持上呼吸道的通畅。再将头转回正面。（急救者从后、抱起溺者的腰部，使其背向上，头向下，也能使水倒出来）。"
                             ,"3.出水后的救护，如果你有资格并经过训练可以做心肺复苏术（CPR）（民众最好能学习CPR（心肺复苏术）技巧，救人又救己。）但是如果不知道心肺复苏术时立即寻求援助。当你在等待时可试做口对口复苏术，这能拯救生命。如果溺水者呼吸心跳已停止，立即进行口对口人工呼吸，同时进行胸外心脏按压。A、确定一下这位失去知觉的人到底是否在呼吸，看看他或她的胸部，看是否可以见到呼吸的样子。B、使溺水者仰卧。C、为了采取通用安全措施，尽可能戴上乳胶手套，弄开他的嘴，用你的手指除掉咽部或气道里的任何阻塞物。D：为了避免艾滋病毒或其他致命病毒通过唾液传播，把你的一次性导气管袋放在你的口和他的口上（显然，如果此人是你亲密的家庭成员，你可以不必这样做）E、把一只手放在溺水者的下颌，另一只手放在他的前额。翘起他的头直至你能使他的气道通畅，溺水者的口应该是张开的。F、捏鼻孔使鼻孔关闭。G、你做深呼吸。H、用你的嘴完全把他的嘴罩住。I、正常吹气进入溺水者的嘴里，连续做2次。J、如果你是给一个成年人做，此时停5秒钟然后再重复做第F到第I步，如果你给一个儿童，或婴儿做，此时停止3钞钟，然后再重复第F到第I步K、重复这一过程"
                             ,"4.送往医院，当溺水者开始呼吸和气哽时，你还没有脱离困境。实际上，溺水后的48小时是最危险的。因溺水而发生的并发症肺炎、心衰等，都能在这一时期发生，因此你应尽早将溺水者送往医院。"
                             ,"","",""};
    e9["urgency"]=5;
    e9["video"]="C:/FirstAidapp/video/e9.mp4";
    emergencyType.append(e9);

    QJsonObject e10;
    e10["name"]="气道异物梗阻";
    e10["symptom"]=QJsonArray{"呼吸困难","无法发声","用手抓喉","面色青紫或苍白","",""};
    e10["keywords"]=QJsonArray{"呼吸困难","无法发声","用手抓喉","面色青紫或苍白","卡住了","吃东西卡住了"};
    e10["steps"]=QJsonArray{"成人及1岁以上儿童","1. 施救者站在患者身后，双脚前后分开，前脚距离患者双脚约一脚宽，后脚脚跟踮起，膝盖微弯。让患者坐在自己弓起的大腿上，保持患者身体前倾、头略低、嘴张开。2. 双臂环绕患者腹部，一手握拳，拇指顶住患者肚脐上方两横指处、剑突下方，另一手抓住握拳的手。3. 用手部力量急速拉动双臂，有力地向内、向上冲击患者上腹部，每秒约1次。4. 重复动作直至异物排出或患者恢复呼吸。"
                              ,"1岁以下婴儿"
                             ,"1. 将婴儿面朝下，放在手臂上，用手支撑头部和颈部，手臂靠在大腿上。2. 用另一只手的掌根在婴儿背部两肩胛骨之间拍击5次。3. 将婴儿翻正，在两乳头连线中点处，用两手指快速按压5次。4. 交替进行拍背和按压胸部动作，直至异物排出。"
                              ,"",""};
    e10["urgency"]=2;
    e10["video"]="C:/FirstAidapp/video/e10.mp4";
    emergencyType.append(e10);

}

QJsonArray EmergencyModel::getJson(){
    return emergencyType;
}
